callgraph.dot
digraph "CallGraph" {
    node [shape=box];
    node_1 [label="reply"];
    node_2 [label="notify"];
    node_3 [label="forward"];
    node_4 [label="tWhile"];
    node_5 [label="tRepeat"];
    node_6 [label="tUntil"];
    node_7 [label="tForeach"];
    node_8 [label="tNested"];
    node_9 [label="contract_init_1801"];
    node_10 [label="exampleWhileLoop"];
    node_11 [label="testReply"];
    node_12 [label="sender"];
    node_13 [label="context"];
    node_14 [label="myBalance"];
    node_15 [label="nativeReserve"];
    node_16 [label="send"];
    node_17 [label="emptyMap"];
    node_18 [label="toCell"];
    node_1 -> node_3 [label="1"];
    node_1 -> node_12 [label="2"];
    node_2 -> node_3 [label="3"];
    node_2 -> node_12 [label="4"];
    node_3 -> node_13 [label="5"];
    node_3 -> node_14 [label="6"];
    node_3 -> node_15 [label="7"];
    node_3 -> node_16 [label="8"];
    node_3 -> node_16 [label="9"];
    node_4 -> node_16 [label="10"];
    node_4 -> node_12 [label="11"];
    node_5 -> node_16 [label="12"];
    node_5 -> node_12 [label="13"];
    node_6 -> node_16 [label="14"];
    node_6 -> node_12 [label="15"];
    node_7 -> node_17 [label="16"];
    node_7 -> node_16 [label="17"];
    node_7 -> node_12 [label="18"];
    node_8 -> node_16 [label="19"];
    node_8 -> node_12 [label="20"];
    node_10 -> node_16 [label="21"];
    node_10 -> node_18 [label="22"];
    node_11 -> node_1 [label="23"];
    node_11 -> node_18 [label="24"];
}
